// pages/news/news.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    str: ` 
        
小型挖掘机是经济投入大的固定资产
小型轮式挖掘机工具，原料使用时注意什么？

1．小型挖掘机是经济投入大的固定资产，为提高其使用年限获得更大的经济效益，设备必须做到定人、定机、定岗位，明确职责。必须调岗时，应进行设备交底。

2．小型挖掘机进入施工现场后，驾驶员应先观察工作面地质及四周环境情况，挖掘机旋转半径内不得有障碍物，以免对车辆造成划伤或损坏。

3．机械发动后，禁止任何人员站在铲斗内，铲臂上及履带上，确保安全生产。

4．小型挖掘机在工作中，禁止任何人员在回转半径范围内或铲斗下面工作停留或行走，非驾驶人员不得进入驾驶室乱摸乱动，不得带培训驾驶员，以免造成电器设备的损坏。

5．小型挖掘机在挪位时，驾驶员应先观察并鸣笛，后挪位，避免机械边有人造成安全事故，挪位后的位置要确保挖掘机旋转半径的空间无任何障碍，严禁违章操作。

6．工作结束后，应将小型挖掘机挪离低洼处或地槽(沟)边缘，停放在平地上，关闭门窗并锁住。
    `
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})